Repository: haruyama/ssh_rfc_ja
Catalog: omegat/ssh/ssh-level2.tmx
Source language: en_us
Languages: ja

source: X.509v3 Certificates for Secure Shell Authentication
ja: セキュアシェル認証のための X.509v3 証明書

source: Standard methods are provided for setting up secure interactive shell sessions and for forwarding ("tunneling") arbitrary TCP/IP ports and X11 connections.
ja: 安全なインタラクティブなシェルのセッションを設定したり任意の TCP/IPポートやX11接続を転送(トンネリング)する標準的な方法が提供されている.

source: The maximum length of message that can be encrypted using RSAEP-OAEP is defined by [RFC3447] in terms of the key length in bytes, which is (KLEN+7)/8.
ja: RSAEP-OAEP を用いて暗号化できるメッセージの最大長は, バイトでの鍵の長さによって [RFC3447] で定義されており, それは (KLEN+7)/8 だ.

source: If the "subsystem" attribute is not specified, no restrictions are placed on which subsystems may be started when authenticated using this key.
ja: "subsystem" 属性が指定されていなければ, この鍵を用いて認証した際に開始できるサブシステムに制限はない.

source: It has been noted that these names resemble STD 11 [RFC0822] email addresses.
ja: この名前が, STD 11 [RFC0822]のメールアドレスと似ていることを明記しておく.

source: Returning Exit Status
ja: 終了ステータスの返却

source: The 'none' MAC Algorithm ..................................32 9.6.
ja: 'none' MAC アルゴリズム ..................................32 9.6.

source: Key File Format .................................................2 3.1.
ja: 鍵ファイルの形式 .................................................2 3.1.

source: In the following sections, the values for the namespaces are textual.
ja: 以下の節では, 名前空間の値はテキストだ.

source: If a key fails validation, the key exchange MUST fail.
ja: 鍵が検証に失敗したら, 鍵交換は失敗しなければならない.

source: Rights to manage public keys are specific and limited to the authenticated user.
ja: 公開鍵を管理する権限は, 認証されたユーザに特有で制限される.

source: Algorithm Definitions
ja: アルゴリズムの定義

source: It is RECOMMENDED that all data sent before this message be delivered to the actual destination, if possible.
ja: 可能ならば, このメッセージの前に送られたすべてのデータが正しい送り先に伝達されることが推奨される.

source: For example, it can be used when the administrator has decided as a matter of policy to require that all key exchanges be authenticated using Kerberos [KRB5], and thus the only permitted key exchange method is the GSS-API-authenticated Diffie-Hellman exchange described above, with Kerberos V5 as the underlying GSS-API mechanism.
ja: 例えば, すべての鍵交換を Kerberos [KRB5]を用いて認証する, つまり 基底の GSS-API メカニズム として Kerberos V5 を用いる 前述の GSS-API で認証された Diffie-Hellman 交換のみを 鍵交換法として許可すると管理者がポリシーを決定した場合に, このアルゴリズムを用いることができる.

source: All terminal sessions, forwarded connections, etc., are channels.
ja: すべてのターミナルのセッション, 転送された接続などは, チャンネルだ.

source: Servers and clients SHOULD support groups with a modulus length of k bits, where 1024 <= k <= 8192.
ja: サーバとクライアントは, 法の長さ k が1024 <= k <= 8192 である群をサポートする必要がある.

source: Signing and verifying using the X.509v3-based public key algorithms specified in this document (x509v3-ssh-dss, x509v3-ssh-rsa, x509v3-ecdsa-sha2-*) is done in the analogous way for the corresponding non-X.509v3-based public key algorithms (ssh-dss, ssh-rsa, ecdsa-sha2-*, respectively); the x509v3-rsa2048-sha256 public key algorithm provides a new mechanism, similar to ssh-rsa, but has a different hash function and additional key size constraints.
ja: この文書で指定するX.509v3 ベースの公開鍵アルゴリズム (x509v3-ssh-dss, x509v3-ssh-rsa, x509v3-ecdsa-sha2-*) は, 対応する非 X.509v3 ベースの公開鍵アルゴリズム (それぞれ ssh-dss, ssh-rsa, ecdsa-sha2-*) と似たやり方で署名と検証を行なう. 509v3-rsa2048-sha256 公開鍵アルゴリズムは新しいメカニズムを提供するが, ssh-rsa と似ている. ただし, 異なるハッシュ関数と追加の鍵サイズの制約を持っている.

source: o If the KeyUsage extension is present in a certificate for the ecmqv-sha2 key exchange method, then the keyAgreement bit MUST be set.
ja: o ecmqv-sha2 鍵交換法のための証明書に KeyUsage 拡張が存在したら, keyAgreement ビットが設定されなければならない.

source: Assigned Algorithm Names
ja: 割り当て済みのアルゴリズム名

source: Message Numbers ............................................5 4.1.1.
ja: メッセージ番号 .........................................5 4.1.1.

source: The tmSessionID MUST be recorded per message at the time of receipt.
ja: tmSessionID は受信時にメッセージ単位で記録されなければならない.

source: As [RFC4253] says, though, "Arcfour (and RC4) has problems with weak keys, and should be used with caution." These problems are described in more detail in [MANTIN01], along with a recommendation to discard the first 1536 bytes of keystream so as to ensure that the cipher's internal state is thoroughly mixed.
ja: しかし, [RFC4253] では, "Arcfour (と RC4) は弱い鍵の問題がある. 注意して利用しなければならない" となっている. [MANTIN01]にこれらの問題はより詳細に記述されている. [MANTIN01]では暗号の内部状態が完全に混合されるのを保証するために 鍵ストリームの最初の 1536 バイトを破棄するよう推奨している.

source: Some readers will worry about the increase in packet size due to new headers, padding, and the Message Authentication Code (MAC).
ja: 新しいヘッダやパディング, メッセージ認証コード(MAC)のためにパケットサイズが増大することを心配する読者もいるだろう.

source: The Secure Shell (SSH) is a protocol for secure remote login and other secure network services over an insecure network.
ja: セキュア シェル (SSH) プロトコルは, 安全ではないネットワーク上での安全なリモートログインや他の安全なネットワークサービスのためのプロトコルだ.

source: Since the GSS-API key exchange methods described in this section do not require the use of public key signature or encryption algorithms, they MAY be used with any host key algorithm, including the "null" algorithm described in Section 5.
ja: この節で記述するGSS-API 鍵交換法は, 公開鍵の署名や暗号アルゴリズムの利用を必要としないので, 5節で記述する "null" アルゴリズムを含むどのホスト鍵アルゴリズムに対しても利用してもよい.

source: The public key fingerprint method presented here relies on the MD5 one-way hash function, which is known to have certain weaknesses regarding its collision resistance; however, the particular use made of MD5 here depends solely on its 2nd-preimage resistance, not on its collision resistance.
ja: この文書で提示した公開鍵の指紋は MD5 一方向関数に依存している. MD5 はその衝突耐性に関する弱点があることで知られている; しかし, この公開鍵指紋での MD5 の利用は単に 2次原像耐性に依存しており, 衝突耐性には依存していない.

source: Accordingly, implementers are encouraged to use high-assurance methods when implementing this specification and other parts of the Secure Shell protocol suite.
ja: 従って, この仕様とセキュアシェルプロトコルスイートの他の部分を実装する際に, 高い品質の保証の方法を用いることが実装者に推奨される.

source: The securityName MAY be derived from the tmSecurityName by a Security Model and MAY be used to configure notifications and access controls in MIB modules.
ja: securityName は, セキュリティモデルによって tmSecurityName から導出されてもよいし, MIB モジュールで通知とアクセス制御を設定するのに用いられてもよい.

source: It MUST be possible to determine this from the public key algorithm name.
ja: アルゴリズムは, 公開鍵アルゴリズム名から決められなければならない.

source: L is the field size and N is the sub-field size.
ja: L はフィールドサイズで, Nは サブフィールドのサイズだ.

source: The total length of the PT MUST be a multiple of 16 octets (the block size of AES).
ja: PT の合計の長さは, 16 オクテット (AES のブロックサイズ)の倍数でなければならない.

source: It is intended to be run over the SSH user authentication protocol [SSH-USERAUTH].
ja: SSH 認証プロトコル [SSH-USERAUTH] 上で動くことが目的だ．

source: They SHOULD also be able to display at least 30 characters for the name and prompts.
ja: また, すべてのクライアントは, name と prompt について 少なくとも 30 文字表示できる必要がある.

source: In particular, because of the flexible nature of the SSH connection protocol, it may not be possible to determine the local security policy, if any, that should apply at the time of authentication because the kind of service being requested is not clear at that instant.
ja: 特に, SSHコネクションプロトコルの柔軟な特徴のために, 認証の時点で適用されるべきローカルなセキュリティポリシーを決定することができないかもしれない. どのようなサービスが要求されるかは認証の時点では明らかではないからだ.

source: For each prompt, the corresponding echo field indicates whether the user input should be echoed as characters are typed.
ja: それぞれのpromptで, 対応する echo フィールドは, ユーザの入力を入力された文字でエコーするかどうかを指定する.

source: The number referring to a channel may be different on each side.
ja: チャンネルを示す番号は, それぞれの側で異なることがある.

source: IANA Considerations .
ja: IANA の考察 .

source: Elliptic Curve Domain Parameter Identifiers ...............10 6.2.
ja: 楕円曲線ドメインパラメータ識別子 ...............10 6.2.

source: See errata for RFC 4742 at http://www.rfc-editor.org.
ja: http://www.rfc-editor.org で RFC 4742 の正誤表を参照せよ.

source: However, compliant implementations MUST comply with [RFC5280].
ja: しかし, 準拠する実装は [RFC5280] に従わなければならない.

source: The Secure Shell (SSH) Protocol Assigned Numbers
ja: セキュア シェル (SSH) プロトコルに割り当てられた番号(訳注: や名前)

source: Conventions
ja: 規約

source: Servers MUST NOT advertise the "null" host key algorithm unless it is the only algorithm advertised.
ja: "null" ホスト鍵アルゴリズムがクライアントに告知する唯一のアルゴリズムでなければ, このアルゴリズムをサーバは告知してはならない.

source: o Integrity key client to server: HASH(K || H || "E" || session_id)
ja: o クライアントからサーバへの完全性のための(MACの)鍵: HASH(K || H || "E" || session_id)

source: Manageability Considerations ...................................13 8.1.
ja: 管理の上での考慮 ...................................13 8.1.

source: The Elliptic Curve Menezes-Qu-Vanstone (ECMQV) key exchange is defined by the method name "ecmqv-sha2".
ja: 楕円曲線 Menezes-Qu-Vanstone (ECMQV) 鍵交換は名前 "ecmqv-sha2" で定義される.

source: Its purpose is to make it impossible for either side to fully determine the keys and the session identifier.
ja: 相手側が完全に鍵やセッション識別子を決めるのを防ぐために使われる.

source: Method Names ...................................................10 6.1.
ja: 方法の名前 ...................................................10 6.1.

source: This mechanism exists for backwards compatibility with implementations of previous versions of this document.
ja: このメカニズムは, この文書の以前のバージョンの実装との後方互換性のために存在する.

source: Suite B Cryptographic Suites for Secure Shell (SSH)
ja: セキュアシェル (SSH) のための Suite B 暗号スイーツ

source: This document describes the SSH Connection Protocol.
ja: この文書は, SSH コネクションプロトコルについて記述する.

source: If transmission errors or message manipulation occur, the connection is closed.
ja: 転送エラーやメッセージの操作がおきると, 接続は終了される.

source: ECC Public Key Algorithm (ecdsa-sha2-*)
ja: 楕円曲線公開鍵アルゴリズム (ecdsa-sha2-*)

source: With this method, the possession of a private key serves as authentication.
ja: この認証法では, 秘密鍵を所持によって認証を行なう.

source: A list of the required and recommended curves and their OIDs can be found in Section 10.
ja: 必須/推奨の曲線とそのOIDのリストは, 10節にある.

source: The Public Key Subsystem currently defines four operations: add, remove, list, and listattributes.
ja: 公開鍵サブシステムは4つの操作を現在定義している: 追加, 削除, 一覧の取得, サーバの属性の取得だ.

source: These are chosen as described in Section 3 of [GROUP-EXCHANGE].
ja: これらは， [GROUP-EXCHANGE]の3節で記述されているように選ばれる．

source: The chosen compression algorithm MUST be the first algorithm on the client's name-list that is also on the server's name-list.
ja: 選択される圧縮アルゴリズムは, サーバの名前リストに存在するものの中でクライアントの名前リストの最初にあるアルゴリズムでなければならない.

source: The 'packet_length' field and 'mac' will be computed from the compressed payload.
ja: 'packet_length' と 'mac' は, 圧縮された payload から計算される.

source: For example, the encryption mode specified in [RFC4253] is vulnerable to a chosen-plaintext privacy attack.
ja: たとえば, [RFC4253]で定義された暗号モードは, 選択平文プライバシー攻撃に脆弱だ.

source: Binding Encryption Keys ...................................16 3.6.
ja: 暗号鍵の束縛 ...................................16 3.6.

source: If no confidentiality is provided ("none" cipher), password authentication SHOULD be disabled.
ja: 機密性が提供されない("none" 暗号)場合は, パスワード認証は無効とされる必要がある.

source: The use of SPNEGO combined with GSS-API mechanisms used without SPNEGO can lead to interoperability problems.
ja: SPENGO なしで利用する GSS-API メカニズムと組合せて SPENGO を利用すると, 相互運用上の問題が発生しうる.

source: For incoming messages, SSH-specific security parameters are translated by the Transport Model into security parameters independent of the Transport and Security Models.
ja: 受信メッセージに対して, SSH特有のセキュリティパラメータは, トランスポートとセキュリティモデルに独立なセキュリティパラメータへとトランスポートモデルによって翻訳される.

source: This document describes the SSH authentication protocol framework and public key, password, and host-based client authentication methods.
ja: この文書は, SSH認証プロトコルのフレームワークと, 公開鍵, パスワード, ホストベース認証法について記述する.

source: These encryption methods are in addition to the encryption methods described in Section 6.3 of [RFC4253].
ja: これらの暗号法は [RFC4253]の6.3節で記述されている暗号法に追加される.

source: Local accounts may be supported through the use of the publickey, hostbased, or password methods.
ja: ローカルアカウントは, 公開鍵, ホストベース, パスワードといった方法の利用によってサポートされるだろう.

source: Authentication methods are identified by their name, as defined in [SSH-ARCH].
ja: 認証法は, [SSH-ARCH]で定義されているように, その名前で識別される.

source: If a BREAK of any kind was preformed, SSH_MSG_CHANNEL_SUCCESS MUST be sent.
ja: なんらかの BREAK が実行されたら, SSH_MSG_CHANNEL_SUCCESS が送られなければならない.

source: Closing a Channel
ja: チャンネルの終了

source: This format is the same as for ecdsa-sha2-* signatures in Section 3.1.2 of [RFC5656].
ja: [RFC5656] の 3.1.2 節の ecdsa-sha2-* 署名と, このフォーマットは同一だ.

source: The compression context is initialized after each key exchange, and is passed from one packet to the next, with only a partial flush being performed at the end of each packet.
ja: 圧縮コンテキストは鍵交換のあとで初期化され, 1つのパケットからその次のパケットへと渡される. それぞれのパケットの終わりでは, 部分的な flush のみが行なわれる.

source: o If the key exchange fails due to any GSS-API error on the server (including errors returned by GSS_Accept_sec_context()), the server MAY send a message informing the client of the details of the error.
ja: o (GSS_Accept_sec_context() によって返されるエラーを含む) サーバ側の GSS-API のエラーのために鍵交換が失敗する場合は, エラーの詳細をクライアントに知らせるメッセージをサーバは送ってもよい.

source: Processing Binary Packets in AES-GCM Secure Shell
ja: AES-GCM セキュアシェルのバイナリパケットの処理

source: When the server receives this message, it MUST check whether the supplied key is acceptable for authentication, and if so, it MUST check whether the signature is correct.
ja: サーバがこのメッセージを受け取ったら, 提供された鍵が認証で受け入れられるかチェックしなければならない. もしそうならば署名が正しいかチェックしなければならない.

source: The key exchange method described in Section 2 depends on the underlying GSS-API mechanism to provide both mutual authentication and per-message integrity services.
ja: 2節で記述した鍵交換法は, 相互認証とメッセージ単位の完全性サービスを提供する基底の GSS-API メカニズムに依存している.

source: This, combined with encoding the result as an SSH "string", gives a result that is similar, but not identical, to the SSH "mpint" encoding applied to that integer.
ja: これをSSHの "string" としてエンコードすると, SSHの "mpint" エンコーディングをこの整数に適用するのと似ているが異なる結果を生成する.

source: Compression MAY be stateful, depending on the method.
ja: 圧縮は, 方法によってはステートフルでもよい.

source: server_host_key_algorithms A name-list of the algorithms supported for the server host key.
ja: server_host_key_algorithms サポートするサーバホスト鍵のアルゴリズムの名前リスト.

source: Choice of Generator
ja: 生成器の選択

source: Public Key Subsystem Request Names
ja: 公開鍵サブシステムの要求名

source: In particular, it is assumed that an entity implementing the SNMP-SSH-TM-MIB will implement the SNMPv2-MIB [RFC3418] and the SNMP-FRAMEWORK-MIB [RFC3411].
ja: 特に, SNMP-SSH-TM-MIB を実装するエンティティは, SNMPv2-MIB [RFC3418] と SNMP-FRAMEWORK-MIB [RFC3411] を実装することが仮定される.

source: Additional Messages
ja: 追加のメッセージ

source: Initiating GSS-API Authentication
ja: GSS-API 認証の開始

source: One specific scenario for having a configurable policy is where clients do not use fully qualified host names to connect to servers.
ja: 設定可能なポリシーを持つ場合の特有のシナリオとして, クライアントが接続するサーバのFQDNを使わない場合がある.

source: The server MUST verify that the host key actually belongs to the client host named in the message, that the given user on that host is allowed to log in, and that the 'signature' value is a valid signature on the appropriate value by the given host key.
ja: サーバは, 以下を検証しなければならない. ホスト鍵が本当にメッセージ中のクライアントホストに属している, クライアントホストのユーザがログインを許可されているか, 'siggnature' の値が, ホスト鍵に対して正当かどうか.

source: o "" means that connections are to be accepted on all protocol families supported by the SSH implementation.
ja: o ""' は, SSHの実装がサポートするすべてのプロトコルファミリで接続を受け入れることを意味する

source: 72 ONLCR Map NL to CR-NL.
ja: 72 ONLCR NLをCR-NLに置き換える.

source: o Signature and/or encryption algorithms.
ja: o 署名と/ないし暗号化アルゴリズム

source: Consistent with Section 8 of [SSH-ARCH] and Section 4.6 of [SSH-NUMBERS], this document makes the following registrations:
ja: [SSH-ARCH] の 8節と [SSH-NUMBERS] の4.6節と整合するため, この文書は次の登録を行なう.

source: string Q_C // the client's ephemeral contribution to the // ECDH exchange, encoded as an octet string
ja: string Q_C // ECDH 交換に対するクライアントの一時 contribution. オクテット文字列としてエンコードされる

source: mac_algorithms A name-list of acceptable MAC algorithms in order of preference.
ja: mac_algorithms 受け入れ可能なMACアルゴリズムの優先度順の名前リスト.

source: Once the mechanism OID has been selected, the client will then initiate an exchange of one or more pairs of SSH_MSG_USERAUTH_GSSAPI_TOKEN packets.
ja: メカニズムのOIDが選択されたら， SSH_MSG_USERAUTH_GSSAPI_TOKEN パケットの1つないしそれ以上のペアをクライアントは交換しはじめる．

source: Banner Message
ja: バナー メッセージ

source: However, the terminal emulation type (e.g., "vt100") is transmitted to the remote site, and it implicitly specifies the character set and encoding.
ja: しかし, ("vt100"のような) 端末エミュレーションの種類は,リモートサイトに転送され, これは文字セットやエンコーディングを暗黙のうちに指定する.

source: The provisions of Section 11 apply to unrecognized messages.
ja: 11 節の規定が, 認識されないメッセージに適用される.

source: Each line in the file MUST NOT be longer than 72 8-bit bytes excluding line termination characters.
ja: ファイルの各行は, 行の終端文字を除いて 72 8bit バイトより長くてはならない.

source: The SSH authentication protocol is a general-purpose user authentication protocol.
ja: SSH 認証プロトコルは, 汎用のユーザ認証プロトコルだ.

source: Initial Assignment of Signal Names
ja: シグナル名の初期の割り当て

source: This event may provide an attacker an opportunity to replay a previously recorded packet with an identical sequence number but only if the peers have not rekeyed since the transmission of the first packet with that sequence number.
ja: このイベントは, 同一のシーケンス番号を持つ以前に記録したパケットを攻撃者がリプレイする機会を提供する. しかし, そのシーケンス番号の最初のパケットの転送からピアが鍵の再作成をしていない場合のみだ.

source: It is recommended that implementations either maintain a list of allowable variable names or only set environment variables after the server process has dropped sufficient privileges.
ja: 許可する変数名のリストを管理するかサーバプロセスが十分な権限を落したあとで環境変数を設定するかのどちらかにすることが, 実装には推奨される.

source: This document should be read only after reading the SSH architecture document [SSH-ARCH].
ja: この文書は, SSHアーキテクチャ文書 [SSH-ARCH]を読んだあとに読むべきだ.

source: Use with SNMPv1/v2c Messages ..............................32 9.7.
ja: SNMPv1/v2c メッセージの利用 ..............................32 9.7.

source: It is suggested that this field default to user@hostname for the user and machine used to generate the key.
ja: このフィールドのデフォルトを, 鍵を作成するのに利用したユーザとマシンからなる user@hostname とするのを推奨する.

source: Extensibility ..............................................6 4.3.
ja: 拡張性 ..............................................6 4.3.

source: o The other specifications use different BEGIN/END delimiters (five dashes, no space rather than four dashes and a space).
ja: o 他の仕様は異なる開始/終了デリミタ(4つのダッシュと空白ではなく, 空白なしの5つのダッシュ) を利用している.

source: Each tunnel gets a distinct set of
ja: それぞれのチャンネルは, 対称鍵の独立の集合を持つ.

source: The SSH Transport Model MUST NOT be used with an SSH connection with the "none" userauth method.
ja: SSH トランスポートモデルは, "none" ユーザ認証法を SSH の接続で用いてはならない.

source: The window size specifies how many bytes the other party can send before it must wait for the window to be adjusted.
ja: window size は, windowが調整されるまでに相手側が送ることのできるバイト数を指定する.

source: It is up to the server to decide how to map user names to accepted user names.
ja: ユーザ名を受け付けるものにどのようにマッピングするかは, サーバに委ねられている.

source: Rekeying Considerations ....................................7 6.2.
ja: 鍵の再発行の考察 ....................................7 6.2.

source: The SSH Connection Protocol has been designed to run on top of the SSH transport layer and user authentication protocols ([SSH-TRANS] and [SSH-USERAUTH]).
ja: SSH コネクションプロトコルは, SSH トランスポート層・ユーザ認証プロトコル上で動作するように設計されている([SSH-TRANS] と [SSH-USERAUTH]).

source: The client MAY send several authentication requests without waiting for responses from previous requests.
ja: クライアントは, 前の要求の応答を待つことなしに複数の認証の要求を送ってよい.

source: snmpSshtmSessionCloses OBJECT-TYPE SYNTAX Counter32 MAX-ACCESS read-only STATUS current DESCRIPTION "The number of times a closeSession() request has been executed as an SSH client, whether it succeeded or failed.
ja: snmpSshtmSessionCloses OBJECT-TYPE SYNTAX Counter32 MAX-ACCESS read-only STATUS current DESCRIPTION "成功/失敗に関わらず, SSH クライアントとして closeSession() 要求が実行された回数

source: If the :base:1.1 capability is advertised by both peers, the chunked framing mechanism (see Section 4.2) is used for the remainder of the NETCONF session.
ja: :base:1.1 機能が両方のピアで告知されていたら, チャンクされたフレーミングメカニズム (4.2 節参照) が残りの NETCONF セッションで用いられる.

source: If the BREAK length parameter is 0, the BREAK SHOULD be interpreted as the default BREAK signal length of the chipset or underlying chipset driver.
ja: BREAK length parameter が 0 なら, チップセットや基盤となるチップセットのドライバのデフォルトの BREAK シグナルの長さと解釈される.

source: The SSH Transport Model converts that information into suitable security parameters for SSH, establishes sessions as needed, and passes messages to the SSH Subsystem for sending.
ja: SSH トランスポートモデルは, SSHにとって適切なセキュリティパラメータに情報を変換し, 必要に応じてセッションを確立し, 送信のために SSH サブシステムにメッセージを渡す.

source: Client Server ------ ------ Generate ephemeral key pair.
ja: クライアント サーバ ------ ------ 一時鍵ペアの生成

source: Initial Assignments .................................8
ja: 初期の割り当て .................................8

source: AES has been published by The US Federal Information Processing Standards as [FIPS-197], and the cryptographic community has accepted AES as well.
ja: AESは US Federal Information Processing Standards as [FIPS-197] として公開され, また暗号学のコミュニティも同様にAESを受け入れた.

source: Several RFCs have documented how each of the Suite B components are to be integrated into Secure Shell (SSH):
ja: Suite B の構成要素のそれぞれをセキュアシェル (SSH) にどのように統合するかについていくつかのRFCが記述された:

source: Key Format .................................................4 3.1.1.
ja: 鍵のフォーマット .................................................4 3.1.1.

source: 40 IXOFF Enable input flow control.
ja: 40 IXOFF 入力のフロー制御を有効にする.

source: Authentication Protocol Support ....................10 3.1.4.
ja: 認証プロトコルのサポート ....................10 3.1.4.

source: The public keys added, removed, and listed using this protocol are specific and limited to those of the authenticated user.
ja: このプロトコルを用いて公開鍵を追加, 削除, 一覧の取得をするのは, 認証されたユーザの公開鍵に特定され制限される.

source: A zero 'exit_status' usually means that the command terminated successfully.
ja: ゼロの 'exit_status' は, 通常コマンドが正常終了したことを意味する.

source: When this happens, the client SHOULD close the connection to the server, and reconnect using the old protocol.
ja: このときは, クライアントはサーバとの接続を切断し古いプロトコルを利用して再接続する必要がある.

source: Only the first few fields are defined; the remaining fields depend on the authentication method.
ja: 最初のいくつかのフィールドだけが定義されている; 残りのフィールドは認証法に依存する.

source: This memo also defines a portion of the Management Information Base (MIB) for use with network management protocols in TCP/IP-based internets.
ja: このメモは, TCP/IPベースのインターネットでネットワークマネジメントプロトコルと共に用いる管理情報ベース (MIB) の部分も定義する.

source: Conventions for Names
ja: 命名規約

source: The Header-tag MUST be encoded in US-ASCII.
ja: Header-tag は US-ASCII でエンコードされなければならない.

source: A Transport Model SHOULD NOT require changes to the SNMP architecture.
ja: トランスポートモデルは, SNMP アーキテクチャに変更を求めないほうがよい.

source: The "rsa2048-sha256" method specifies RSA key exchange as described above with the following parameters:
ja: "rsa2048-sha256" 法は, 次のパラメータで以上で記述した RSA 鍵交換を指定する.

source: The server MUST respond with SSH_MSG_USERAUTH_SUCCESS (if no more authentications are needed), or SSH_MSG_USERAUTH_FAILURE (if the request failed, or more authentications are needed).
ja: サーバは, 追加の認証が必要なければ SSH_MSG_USERAUTH_SUCCESS で, 認証要求が失敗したり追加の認証が必要な場合は SSH_MSG_USERAUTH_FAILURE で応答しなければならない.

source: If both checks succeed, this method is successful.
ja: 両方のチェックが成功したら, この認証法は成功だ.

source: To open the Public Key Subsystem, the client sends:
ja: 公開鍵サブシステムを開始するためにクライアントは以下を送る:

source: In some jurisdictions, sending a warning message before authentication may be relevant for getting legal protection.
ja: 法的な事情によっては, 認証の前に警告メッセージを送ることで, 法律上な保護が得られる場合がある.

source: There may be several different authenticated services provided.
ja: いくつかの異なる認証されたサービスが提供されることがある.

source: Once the session has been set up, a program is started at the remote end.
ja: セッションが設定されると, プログラムがリモート側で起動される.
